app/Models/CommonModel.php

SELECT *
FROM `merged`
---
    function getdata($name)
    {
        $db = \Config\Database::connect();
        $builder = $this->table('merged');
        $builder->select('*');
        $builder->where('product_name', $name);
            $query = $builder->get();