app/Models/FormModel.php

SELECT *
FROM `merged`
WHERE `product_name` = 'Pepperoni Pizza'
---
function getdata($name)
{
    $db = \Config\Database::connect();
    $builder = $this->table('merged');
    $builder->select('*');
    $builder->where('product_name', $name);
        $query = $builder->get();

SELECT *
FROM `merged`
WHERE `product_category` = 'Pizza'
---
function getcategorydata($product_category, $where=array())
{
    $db = \Config\Database::connect();
    $builder = $this->table('merged');
    $builder->select('*');
    $builder->where('product_category', $product_category);
        $query = $builder->get();

SELECT *
FROM `merged`
WHERE `veg_non_veg` = 'Veg'
---
function getvegnonveg($veg_non_veg, $where=array())
{
    $db = \Config\Database::connect();
    $builder = $this->table('merged');
    $builder->select('*');
    $builder->where('veg_non_veg', $veg_non_veg);
        $query = $builder->get();

SELECT *
FROM `merged`
WHERE `topping_name` = 'Mozzarella'
---
function gettopping($topping, $where=array())
{
    $db = \Config\Database::connect();
    $builder = $this->table('merged');
    $builder->select('*');
    $builder->where('topping_name', $topping);
        $query = $builder->get();